<?xml version="1.0"?>
<GCC_XML cvs_revision="1.121">
  <Namespace id="_1" name="::" members="_3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49 _50 _51 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _66 _67 _68 _69 _70 _71 _72 _73 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _2 _102 _103 _65 _104 _105 _106 _107 _108 _109 _110 _111 _112 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _136 _137 _138 _139 _140 _141 _142 _143 _144 _145 _146 _147 _148 _149 _150 _151 _152 _153 _154 _155 _156 _157 " mangled="_Z2::" demangled="::"/>
  <Namespace id="_2" name="std" context="_1" members="" mangled="_Z3std" demangled="std"/>
  <Function id="_3" name="zmq_init" returns="_158" context="_1" location="f0:130" file="f0" line="130" extern="1">
    <Argument name="app_threads" type="_91" location="f0:130" file="f0" line="130"/>
    <Argument name="io_threads" type="_91" location="f0:130" file="f0" line="130"/>
    <Argument name="flags" type="_91" location="f0:130" file="f0" line="130"/>
  </Function>
  <Function id="_4" name="zmq_setsockopt" returns="_91" context="_1" location="f0:179" file="f0" line="179" extern="1">
    <Argument name="s" type="_158" location="f0:179" file="f0" line="179"/>

  <Function id="_137" name="__builtin_ccosh" returns="_168" context="_1" mangled="ccosh" location="f1:106" file="f1" line="106" extern="1" attributes="nothrow pure no vops">
    <Argument type="_168" location="f1:106" file="f1" line="106"/>
  </Function>
  <Function id="_138" name="__builtin_ccosl" returns="_166" context="_1" mangled="ccosl" location="f1:104" file="f1" line="104" extern="1" attributes="nothrow pure no vops">
    <Argument type="_166" location="f1:104" file="f1" line="104"/>
  </Function>
  <Function id="_139" name="__builtin_ctanhf" returns="_165" context="_1" mangled="ctanhf" location="f1:126" file="f1" line="126" extern="1" attributes="nothrow pure no vops">
    <Argument type="_165" location="f1:126" file="f1" line="126"/>
  </Function>
  <Function id="_140" name="__builtin_ctanhl" returns="_166" context="_1" mangled="ctanhl" location="f1:128" file="f1" line="128" extern="1" attributes="nothrow pure no vops">
    <Argument type="_166" location="f1:128" file="f1" line="128"/>
  </Function>
  <Function id="_141" name="__builtin_ceilf" returns="_162" context="_1" mangled="ceilf" location="f1:37" file="f1" line="37" extern="1" attributes="nothrow const">
    <Argument type="_162" location="f1:37" file="f1" line="37"/>
  </Function>
  <Function id="_142" name="__builtin_ceill" returns="_163" context="_1" mangled="ceill" location="f1:38" file="f1" line="38" extern="1" attributes="nothrow const">
    <Argument type="_163" location="f1:38" file="f1" line="38"/>
  </Function>
  <Function id="_143" name="__builtin_csinf" returns="_165" context="_1" mangled="csinf" location="f1:114" file="f1" line="114" extern="1" attributes="nothrow pure no vops">
    <Argument type="_165" location="f1:114" file="f1" line="114"/>
  </Function>
  <Function id="_144" name="__builtin_csinh" returns="_168" context="_1" mangled="csinh" location="f1:118" file="f1" line="118" extern="1" attributes="nothrow pure no vops">
    <Argument type="_168" location="f1:118" file="f1" line="118"/>
  </Function>
  <Function id="_145" name="__builtin_csinl" returns="_166" context="_1" mangled="csinl" location="f1:116" file="f1" line="116" extern="1" attributes="nothrow pure no vops">
    <Argument type="_166" location="f1:116" file="f1" line="116"/>
  </Function>
  <Function id="_146" name="__builtin_acos" returns="_160" context="_1" mangled="acos" location="f1:24" file="f1" line="24" extern="1" attributes="nothrow">
    <Argument type="_160" location="f1:24" file="f1" line="24"/>
  </Function>
  <Function id="_147" name="__builtin_ctzll" returns="_91" context="_1" location="f1:98" file="f1" line="98" extern="1" attributes="nothrow const">
    <Argument type="_164" location="f1:98" file="f1" line="98"/>
  </Function>
  <Function id="_148" name="__builtin_cargf" returns="_162" context="_1" mangled="cargf" location="f1:93" file="f1" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_165" location="f1:93" file="f1" line="93"/>
  </Function>
  <Function id="_149" name="__builtin_cargl" returns="_163" context="_1" mangled="cargl" location="f1:95" file="f1" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_166" location="f1:95" file="f1" line="95"/>
  </Function>
  <Function id="_150" name="__builtin_cosf" returns="_162" context="_1" mangled="cosf" location="f1:40" file="f1" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_162" location="f1:40" file="f1" line="40"/>
  </Function>
  <Function id="_151" name="__builtin_cosh" returns="_160" context="_1" mangled="cosh" location="f1:41" file="f1" line="41" extern="1" attributes="nothrow">
    <Argument type="_160" location="f1:41" file="f1" line="41"/>
  </Function>
  <Function id="_152" name="__builtin_cosl" returns="_163" context="_1" mangled="cosl" location="f1:44" file="f1" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_163" location="f1:44" file="f1" line="44"/>
  </Function>
  <Function id="_153" name="__builtin_sinf" returns="_162" context="_1" mangled="sinf" location="f1:76" file="f1" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_162" location="f1:76" file="f1" line="76"/>
  </Function>
  <Function id="_154" name="__builtin_sinh" returns="_160" context="_1" mangled="sinh" location="f1:77" file="f1" line="77" extern="1" attributes="nothrow">
    <Argument type="_160" location="f1:77" file="f1" line="77"/>
  </Function>
  <Function id="_155" name="__builtin_sinl" returns="_163" context="_1" mangled="sinl" location="f1:80" file="f1" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_163" location="f1:80" file="f1" line="80"/>
  </Function>
  <Function id="_156" name="zmq_msg_init" returns="_91" context="_1" location="f0:114" file="f0" line="114" extern="1">
    <Argument name="msg" type="_167" location="f0:114" file="f0" line="114"/>
  </Function>
  <Function id="_157" name="__builtin_csin" returns="_168" context="_1" mangled="csin" location="f1:115" file="f1" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_168" location="f1:115" file="f1" line="115"/>
  </Function>
  <PointerType id="_158" type="_170" size="32" align="32"/>
  <PointerType id="_159" type="_170c" size="32" align="32"/>
  <FundamentalType id="_160" name="double" size="64" align="64"/>
  <PointerType id="_161" type="_187c" size="32" align="32"/>
  <FundamentalType id="_162" name="float" size="32" align="32"/>
  <FundamentalType id="_163" name="long double" size="96" align="32"/>
  <FundamentalType id="_164" name="long long int" size="64" align="64"/>
  <FundamentalType id="_165" name="complex float" size="64" align="32"/>
  <FundamentalType id="_166" name="complex long double" size="192" align="32"/>
  <PointerType id="_167" type="_103" size="32" align="32"/>
  <FundamentalType id="_168" name="complex double" size="128" align="64"/>
  <PointerType id="_169" type="_187" size="32" align="32"/>
  <FundamentalType id="_170" name="void" align="8"/>
  <FundamentalType id="_171" name="long unsigned int" size="32" align="32"/>
  <PointerType id="_172" type="_91" size="32" align="32"/>
  <Field id="_173" name="socket" type="_158" offset="0" context="_65" access="public" location="f0:195" file="f0" line="195"/>
  <Field id="_174" name="fd" type="_91" offset="32" context="_65" access="public" location="f0:199" file="f0" line="199"/>
  <Field id="_175" name="events" type="_189" offset="64" context="_65" access="public" location="f0:201" file="f0" line="201"/>
  <Field id="_176" name="revents" type="_189" offset="80" context="_65" access="public" location="f0:202" file="f0" line="202"/>
  <FundamentalType id="_177" name="long int" size="32" align="32"/>
  <PointerType id="_178" type="_162" size="32" align="32"/>
  <PointerType id="_179" type="_163" size="32" align="32"/>
  <PointerType id="_180" type="_53" size="32" align="32"/>
  <Field id="_181" name="content" type="_158" offset="0" context="_103" access="public" location="f0:106" file="f0" line="106"/>
  <Field id="_182" name="shared" type="_190" offset="32" context="_103" access="public" location="f0:107" file="f0" line="107"/>
  <Field id="_183" name="vsm_size" type="_190" offset="40" context="_103" access="public" location="f0:108" file="f0" line="108"/>
  <Field id="_184" name="vsm_data" type="_191" offset="48" context="_103" access="public" location="f0:109" file="f0" line="109"/>
  <PointerType id="_185" type="_65" size="32" align="32"/>
  <FundamentalType id="_189" name="short int" size="16" align="16"/>
  <FundamentalType id="_190" name="unsigned char" size="8" align="8"/>
  <ArrayType id="_191" min="0" max="29u" type="_190" size="240" align="8"/>
  <FundamentalType id="_187" name="char" size="8" align="8"/>
  <CvQualifiedType id="_187c" type="_187" const="1"/>
  <CvQualifiedType id="_170c" type="_170" const="1"/>
  <File id="f0" name="/usr/local/include/zmq.h"/>
  <File id="f1" name="/usr/share/gccxml-0.9/GCC/4.2/gccxml_builtins.h"/>
  <File id="f2" name="/usr/include/errno.h"/>
  <File id="f3" name="/usr/lib/gcc/i486-linux-gnu/4.2.4/include/stddef.h"/>
  <File id="f4" name="/usr/include/bits/errno.h"/>
</GCC_XML>
