<?xml version="1.0"?>
<GCC_XML cvs_revision="1.121">

  </Function>
  <Function id="_310" name="__builtin_cargf" returns="_336" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_344" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_311" name="__builtin_cargl" returns="_337" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_345" location="f0:95" file="f0" line="95"/>
  </Function>
  <Typedef id="_312" name="pthread_t" type="_33" context="_1" location="f4:50" file="f4" line="50"/>
  <Function id="_313" name="__builtin_cosf" returns="_336" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_336" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_314" name="__builtin_cosh" returns="_334" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_334" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_315" name="__builtin_cosl" returns="_337" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_337" location="f0:44" file="f0" line="44"/>
  </Function>
  <Typedef id="_316" name="ushort" type="_80" context="_1" location="f3:152" file="f3" line="152"/>
  <Function id="_317" name="mincore" returns="_41" throw="" context="_1" location="f9:125" file="f9" line="125" extern="1">
    <Argument name="__start" type="_104" location="f9:125" file="f9" line="125"/>
    <Argument name="__len" type="_230" location="f9:125" file="f9" line="125"/>
    <Argument name="__vec" type="_439" location="f9:125" file="f9" line="125"/>
  </Function>
  <Function id="_318" name="select" returns="_41" context="_1" location="f7:112" file="f7" line="112" extern="1">
    <Argument name="__nfds" type="_41" location="f7:112" file="f7" line="112"/>
    <Argument name="__readfds" type="_384r" location="f7:112" file="f7" line="112"/>
    <Argument name="__writefds" type="_384r" location="f7:112" file="f7" line="112"/>
    <Argument name="__exceptfds" type="_384r" location="f7:112" file="f7" line="112"/>
    <Argument name="__timeout" type="_440r" location="f7:112" file="f7" line="112"/>
  </Function>
  <Function id="_319" name="__lxstat" returns="_41" throw="" context="_1" location="f2:404" file="f2" line="404" extern="1" attributes="__nonnull__(,)">
    <Argument name="__ver" type="_41" location="f2:404" file="f2" line="404"/>
    <Argument name="__filename" type="_335" location="f2:404" file="f2" line="404"/>
    <Argument name="__stat_buf" type="_368" location="f2:404" file="f2" line="404"/>
  </Function>
  <Typedef id="_320" name="__blksize_t" type="_8" context="_1" location="f5:164" file="f5" line="164"/>
  <Typedef id="_321" name="dev_t" type="_155" context="_1" location="f3:62" file="f3" line="62"/>
  <Typedef id="_322" name="__ino64_t" type="_33" context="_1" location="f5:138" file="f5" line="138"/>
  <Function id="_323" name="__builtin_sinf" returns="_336" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_336" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_324" name="__builtin_sinh" returns="_334" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_334" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_325" name="__builtin_sinl" returns="_337" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_337" location="f0:80" file="f0" line="80"/>
  </Function>
  <Function id="_326" name="lockf64" returns="_41" context="_1" location="f13:168" file="f13" line="168" extern="1">
    <Argument name="__fd" type="_41" location="f13:168" file="f13" line="168"/>
    <Argument name="__cmd" type="_41" location="f13:168" file="f13" line="168"/>
    <Argument name="__len" type="_270" location="f13:168" file="f13" line="168"/>
  </Function>
  <Function id="_327" name="creat64" returns="_41" throw="" context="_1" location="f13:140" file="f13" line="140" extern="1" attributes="__nonnull__()">
    <Argument name="__file" type="_335" location="f13:140" file="f13" line="140"/>
    <Argument name="__mode" type="_101" location="f13:140" file="f13" line="140"/>
  </Function>
  <Function id="_328" name="__builtin_csin" returns="_349" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_349" location="f0:115" file="f0" line="115"/>
  </Function>
  <Typedef id="_329" name="__clock_t" type="_8" context="_1" location="f5:145" file="f5" line="145"/>
  <Typedef id="_330" name="__int32_t" type="_41" context="_1" location="f5:41" file="f5" line="41"/>
  <Function id="_331" name="fcntl" returns="_41" context="_1" location="f13:76" file="f13" line="76" extern="1">
    <Argument name="__fd" type="_41" location="f13:76" file="f13" line="76"/>
    <Argument name="__cmd" type="_41" location="f13:76" file="f13" line="76"/>
    <Ellipsis/>
  </Function>
  <Function id="_332" name="lstat64" returns="_41" throw="" context="_1" location="f2:278" file="f2" line="278" extern="1" attributes="__nonnull__(,)">
    <Argument name="__file" type="_335r" location="f2:278" file="f2" line="278"/>
    <Argument name="__buf" type="_341r" location="f2:278" file="f2" line="278"/>
  </Function>
  <Typedef id="_333" name="__caddr_t" type="_220" context="_1" location="f5:186" file="f5" line="186"/>
  <FundamentalType id="_334" name="double" size="64" align="64"/>
  <PointerType id="_335" type="_423c" size="64" align="64"/>
  <FundamentalType id="_336" name="float" size="32" align="32"/>
  <FundamentalType id="_337" name="long double" size="128" align="128"/>
  <Field id="_338" name="tv_sec" type="_203" offset="0" context="_6" access="public" location="f1:71" file="f1" line="71"/>
  <Field id="_339" name="tv_usec" type="_51" offset="64" context="_6" access="public" location="f1:72" file="f1" line="72"/>
  <CvQualifiedType id="_335r" type="_335" restrict="1"/>
  <PointerType id="_341" type="_281" size="64" align="64"/>
  <CvQualifiedType id="_341r" type="_341" restrict="1"/>
  <FundamentalType id="_343" name="long long int" size="64" align="64"/>
  <FundamentalType id="_344" name="complex float" size="64" align="32"/>
  <FundamentalType id="_345" name="complex long double" size="256" align="128"/>
  <Field id="_346" name="__size" type="_443" offset="0" context="_16" access="public" location="f4:134" file="f4" line="134"/>
  <Field id="_347" name="__align" type="_41" offset="0" context="_16" access="public" location="f4:135" file="f4" line="135"/>
  <Field id="_348" name="__val" type="_444" offset="0" context="_21" access="public" location="f6:31" file="f6" line="31"/>
  <FundamentalType id="_349" name="complex double" size="128" align="64"/>
  <PointerType id="_350" type="_159c" size="64" align="64"/>
  <PointerType id="_351" type="_155" size="64" align="64"/>
  <Field id="_352" name="__size" type="_443" offset="0" context="_76" access="public" location="f4:108" file="f4" line="108"/>
  <Field id="_353" name="__align" type="_41" offset="0" context="_76" access="public" location="f4:109" file="f4" line="109"/>
  <FundamentalType id="_354" name="void" align="8"/>
  <Field id="_355" name="fds_bits" type="_446" offset="0" context="_82" access="public" location="f7:72" file="f7" line="72"/>
  <Field id="_356" name="iov_base" type="_104" offset="0" context="_85" access="public" location="f10:46" file="f10" line="46"/>
  <Field id="_357" name="iov_len" type="_230" offset="64" context="_85" access="public" location="f10:47" file="f10" line="47"/>
  <FundamentalType id="_358" name="long long unsigned int" size="64" align="64"/>
  <CvQualifiedType id="_41v" type="_41" volatile="1"/>
  <PointerType id="_360" type="_270" size="64" align="64"/>
  <PointerType id="_361" type="_354c" size="64" align="64"/>
  <Field id="_362" name="__data" type="_365" offset="0" context="_109" access="public" location="f4:127" file="f4" line="127"/>
  <Field id="_363" name="__size" type="_448" offset="0" context="_109" access="public" location="f4:128" file="f4" line="128"/>
  <Field id="_364" name="__align" type="_343" offset="0" context="_109" access="public" location="f4:129" file="f4" line="129"/>
  <Struct id="_365" context="_109" access="public" mangled="N14pthread_cond_t3._7E" demangled="pthread_cond_t::._7" location="f4:118" file="f4" line="118" artificial="1" size="384" align="64" members="_449 _450 _451 _452 _453 _454 _455 _456 " bases=""/>
  <Field id="_366" name="__size" type="_457" offset="0" context="_111" access="public" location="f4:208" file="f4" line="208"/>
  <Field id="_367" name="__align" type="_8" offset="0" context="_111" access="public" location="f4:209" file="f4" line="209"/>
  <PointerType id="_368" type="_176" size="64" align="64"/>
  <PointerType id="_369" type="_41" size="64" align="64"/>
  <Field id="_370" name="__val" type="_458" offset="0" context="_116" access="public" location="f5:144" file="f5" line="144"/>
  <CvQualifiedType id="_368r" type="_368" restrict="1"/>
  <PointerType id="_372" type="_336" size="64" align="64"/>
  <PointerType id="_373" type="_337" size="64" align="64"/>
  <PointerType id="_374" type="_85c" size="64" align="64"/>
  <Field id="_375" name="l_type" type="_57" offset="0" context="_150" access="public" location="f12:175" file="f12" line="175"/>
  <Field id="_376" name="l_whence" type="_57" offset="16" context="_150" access="public" location="f12:176" file="f12" line="176"/>
  <Field id="_377" name="l_start" type="_270" offset="64" context="_150" access="public" location="f12:177" file="f12" line="177"/>
  <Field id="_378" name="l_len" type="_270" offset="128" context="_150" access="public" location="f12:178" file="f12" line="178"/>
  <Field id="_379" name="l_pid" type="_149" offset="192" context="_150" access="public" location="f12:179" file="f12" line="179"/>
  <Field id="_380" name="__prev" type="_460" offset="0" context="_152" access="public" location="f4:63" file="f4" line="63"/>
  <Field id="_381" name="__next" type="_460" offset="64" context="_152" access="public" location="f4:64" file="f4" line="64"/>
  <Field id="_382" name="tv_sec" type="_203" offset="0" context="_159" access="public" location="f8:122" file="f8" line="122"/>
  <Field id="_383" name="tv_nsec" type="_8" offset="64" context="_159" access="public" location="f8:123" file="f8" line="123"/>
  <PointerType id="_384" type="_82" size="64" align="64"/>
  <CvQualifiedType id="_384r" type="_384" restrict="1"/>
  <CvQualifiedType id="_350r" type="_350" restrict="1"/>
  <PointerType id="_387" type="_21c" size="64" align="64"/>
  <CvQualifiedType id="_387r" type="_387" restrict="1"/>
  <Field id="_389" name="l_type" type="_57" offset="0" context="_169" access="public" location="f12:160" file="f12" line="160"/>
  <Field id="_390" name="l_whence" type="_57" offset="16" context="_169" access="public" location="f12:161" file="f12" line="161"/>
  <Field id="_391" name="l_start" type="_208" offset="64" context="_169" access="public" location="f12:163" file="f12" line="163"/>
  <Field id="_392" name="l_len" type="_208" offset="128" context="_169" access="public" location="f12:164" file="f12" line="164"/>
  <Field id="_393" name="l_pid" type="_149" offset="192" context="_169" access="public" location="f12:169" file="f12" line="169"/>
  <Field id="_394" name="__size" type="_443" offset="0" context="_174" access="public" location="f4:214" file="f4" line="214"/>
  <Field id="_395" name="__align" type="_41" offset="0" context="_174" access="public" location="f4:215" file="f4" line="215"/>
  <Field id="_396" name="st_dev" type="_155" offset="0" context="_176" access="public" location="f14:45" file="f14" line="45"/>
  <Field id="_397" name="st_ino" type="_131" offset="64" context="_176" access="public" location="f14:50" file="f14" line="50"/>
  <Field id="_398" name="st_nlink" type="_128" offset="128" context="_176" access="public" location="f14:58" file="f14" line="58"/>
  <Field id="_399" name="st_mode" type="_101" offset="192" context="_176" access="public" location="f14:59" file="f14" line="59"/>
  <Field id="_400" name="st_uid" type="_236" offset="224" context="_176" access="public" location="f14:61" file="f14" line="61"/>
  <Field id="_401" name="st_gid" type="_240" offset="256" context="_176" access="public" location="f14:62" file="f14" line="62"/>
  <Field id="_402" name="__pad0" type="_41" offset="288" context="_176" access="public" location="f14:64" file="f14" line="64"/>
  <Field id="_403" name="st_rdev" type="_155" offset="320" context="_176" access="public" location="f14:66" file="f14" line="66"/>
  <Field id="_404" name="st_size" type="_208" offset="384" context="_176" access="public" location="f14:71" file="f14" line="71"/>
  <Field id="_405" name="st_blksize" type="_320" offset="448" context="_176" access="public" location="f14:75" file="f14" line="75"/>
  <Field id="_406" name="st_blocks" type="_189" offset="512" context="_176" access="public" location="f14:77" file="f14" line="77"/>
  <Field id="_407" name="st_atim" type="_159" offset="576" context="_176" access="public" location="f14:88" file="f14" line="88"/>
  <Field id="_408" name="st_mtim" type="_159" offset="704" context="_176" access="public" location="f14:89" file="f14" line="89"/>
  <Field id="_409" name="st_ctim" type="_159" offset="832" context="_176" access="public" location="f14:90" file="f14" line="90"/>
  <Field id="_410" name="__unused" type="_462" offset="960" context="_176" access="public" location="f14:103" file="f14" line="103"/>
  <Field id="_411" name="__size" type="_463" offset="0" context="_183" access="public" location="f4:193" file="f4" line="193"/>
  <Field id="_412" name="__align" type="_8" offset="0" context="_183" access="public" location="f4:194" file="f4" line="194"/>
  <Field id="_413" name="__size" type="_464" offset="0" context="_204" access="public" location="f4:55" file="f4" line="55"/>
  <Field id="_414" name="__align" type="_8" offset="0" context="_204" access="public" location="f4:56" file="f4" line="56"/>
  <Field id="_415" name="__data" type="_418" offset="0" context="_205" access="public" location="f4:101" file="f4" line="101"/>
  <Field id="_416" name="__size" type="_465" offset="0" context="_205" access="public" location="f4:102" file="f4" line="102"/>
  <Field id="_417" name="__align" type="_8" offset="0" context="_205" access="public" location="f4:103" file="f4" line="103"/>
  <Struct id="_418" name="__pthread_mutex_s" context="_205" access="public" mangled="N15pthread_mutex_t17__pthread_mutex_sE" demangled="pthread_mutex_t::__pthread_mutex_s" location="f4:79" file="f4" line="79" artificial="1" size="320" align="64" members="_466 _467 _468 _469 _470 _471 _472 " bases=""/>
  <Field id="_419" name="__data" type="_422" offset="0" context="_206" access="public" location="f4:168" file="f4" line="168"/>
  <Field id="_420" name="__size" type="_464" offset="0" context="_206" access="public" location="f4:187" file="f4" line="187"/>
  <Field id="_421" name="__align" type="_8" offset="0" context="_206" access="public" location="f4:188" file="f4" line="188"/>
  <Struct id="_422" context="_206" access="public" mangled="N16pthread_rwlock_t4._10E" demangled="pthread_rwlock_t::._10" location="f4:154" file="f4" line="154" artificial="1" size="448" align="64" members="_473 _474 _475 _476 _477 _478 _479 _480 _481 _482 _483 " bases=""/>
  <Field id="_424" name="st_dev" type="_155" offset="0" context="_281" access="public" location="f14:118" file="f14" line="118"/>
  <Field id="_425" name="st_ino" type="_322" offset="64" context="_281" access="public" location="f14:120" file="f14" line="120"/>
  <Field id="_426" name="st_nlink" type="_128" offset="128" context="_281" access="public" location="f14:121" file="f14" line="121"/>
  <Field id="_427" name="st_mode" type="_101" offset="192" context="_281" access="public" location="f14:122" file="f14" line="122"/>
  <Field id="_428" name="st_uid" type="_236" offset="224" context="_281" access="public" location="f14:129" file="f14" line="129"/>
  <Field id="_429" name="st_gid" type="_240" offset="256" context="_281" access="public" location="f14:130" file="f14" line="130"/>
  <Field id="_430" name="__pad0" type="_41" offset="288" context="_281" access="public" location="f14:132" file="f14" line="132"/>
  <Field id="_431" name="st_rdev" type="_155" offset="320" context="_281" access="public" location="f14:133" file="f14" line="133"/>
  <Field id="_432" name="st_size" type="_208" offset="384" context="_281" access="public" location="f14:134" file="f14" line="134"/>
  <Field id="_433" name="st_blksize" type="_320" offset="448" context="_281" access="public" location="f14:140" file="f14" line="140"/>
  <Field id="_434" name="st_blocks" type="_161" offset="512" context="_281" access="public" location="f14:141" file="f14" line="141"/>
  <Field id="_435" name="st_atim" type="_159" offset="576" context="_281" access="public" location="f14:149" file="f14" line="149"/>
  <Field id="_436" name="st_mtim" type="_159" offset="704" context="_281" access="public" location="f14:150" file="f14" line="150"/>
  <Field id="_437" name="st_ctim" type="_159" offset="832" context="_281" access="public" location="f14:151" file="f14" line="151"/>
  <Field id="_438" name="__unused" type="_462" offset="960" context="_281" access="public" location="f14:164" file="f14" line="164"/>
  <PointerType id="_439" type="_78" size="64" align="64"/>
  <PointerType id="_440" type="_6" size="64" align="64"/>
  <CvQualifiedType id="_440r" type="_440" restrict="1"/>
  <ArrayType id="_443" min="0" max="3u" type="_423" size="32" align="8"/>
  <ArrayType id="_444" min="0" max="15u" type="_33" size="1024" align="64"/>
  <ArrayType id="_446" min="0" max="15u" type="_258" size="1024" align="64"/>
  <ArrayType id="_448" min="0" max="47u" type="_423" size="384" align="8"/>
  <Field id="_449" name="__lock" type="_41" offset="0" context="_365" access="public" location="f4:119" file="f4" line="119"/>
  <Field id="_450" name="__futex" type="_31" offset="32" context="_365" access="public" location="f4:120" file="f4" line="120"/>
  <Field id="_451" name="__total_seq" type="_358" offset="64" context="_365" access="public" location="f4:121" file="f4" line="121"/>
  <Field id="_452" name="__wakeup_seq" type="_358" offset="128" context="_365" access="public" location="f4:122" file="f4" line="122"/>
  <Field id="_453" name="__woken_seq" type="_358" offset="192" context="_365" access="public" location="f4:123" file="f4" line="123"/>
  <Field id="_454" name="__mutex" type="_104" offset="256" context="_365" access="public" location="f4:124" file="f4" line="124"/>
  <Field id="_455" name="__nwaiters" type="_31" offset="320" context="_365" access="public" location="f4:125" file="f4" line="125"/>
  <Field id="_456" name="__broadcast_seq" type="_31" offset="352" context="_365" access="public" location="f4:126" file="f4" line="126"/>
  <ArrayType id="_457" min="0" max="31u" type="_423" size="256" align="8"/>
  <ArrayType id="_458" min="0" max="1u" type="_41" size="64" align="32"/>
  <PointerType id="_460" type="_152" size="64" align="64"/>
  <ArrayType id="_462" min="0" max="2u" type="_8" size="192" align="64"/>
  <ArrayType id="_463" min="0" max="7u" type="_423" size="64" align="8"/>
  <ArrayType id="_464" min="0" max="55u" type="_423" size="448" align="8"/>
  <ArrayType id="_465" min="0" max="39u" type="_423" size="320" align="8"/>
  <Field id="_466" name="__lock" type="_41" offset="0" context="_418" access="public" location="f4:80" file="f4" line="80"/>
  <Field id="_467" name="__count" type="_31" offset="32" context="_418" access="public" location="f4:81" file="f4" line="81"/>
  <Field id="_468" name="__owner" type="_41" offset="64" context="_418" access="public" location="f4:82" file="f4" line="82"/>
  <Field id="_469" name="__nusers" type="_31" offset="96" context="_418" access="public" location="f4:84" file="f4" line="84"/>
  <Field id="_470" name="__kind" type="_41" offset="128" context="_418" access="public" location="f4:88" file="f4" line="88"/>
  <Field id="_471" name="__spins" type="_41" offset="160" context="_418" access="public" location="f4:90" file="f4" line="90"/>
  <Field id="_472" name="__list" type="_262" offset="192" context="_418" access="public" location="f4:91" file="f4" line="91"/>
  <Field id="_473" name="__lock" type="_41" offset="0" context="_422" access="public" location="f4:155" file="f4" line="155"/>
  <Field id="_474" name="__nr_readers" type="_31" offset="32" context="_422" access="public" location="f4:156" file="f4" line="156"/>
  <Field id="_475" name="__readers_wakeup" type="_31" offset="64" context="_422" access="public" location="f4:157" file="f4" line="157"/>
  <Field id="_476" name="__writer_wakeup" type="_31" offset="96" context="_422" access="public" location="f4:158" file="f4" line="158"/>
  <Field id="_477" name="__nr_readers_queued" type="_31" offset="128" context="_422" access="public" location="f4:159" file="f4" line="159"/>
  <Field id="_478" name="__nr_writers_queued" type="_31" offset="160" context="_422" access="public" location="f4:160" file="f4" line="160"/>
  <Field id="_479" name="__writer" type="_41" offset="192" context="_422" access="public" location="f4:161" file="f4" line="161"/>
  <Field id="_480" name="__shared" type="_41" offset="224" context="_422" access="public" location="f4:162" file="f4" line="162"/>
  <Field id="_481" name="__pad1" type="_33" offset="256" context="_422" access="public" location="f4:163" file="f4" line="163"/>
  <Field id="_482" name="__pad2" type="_33" offset="320" context="_422" access="public" location="f4:164" file="f4" line="164"/>
  <Field id="_483" name="__flags" type="_31" offset="384" context="_422" access="public" location="f4:167" file="f4" line="167"/>
  <FundamentalType id="_423" name="char" size="8" align="8"/>
  <CvQualifiedType id="_423c" type="_423" const="1"/>
  <CvQualifiedType id="_354c" type="_354" const="1"/>
  <CvQualifiedType id="_159c" type="_159" const="1"/>
  <CvQualifiedType id="_21c" type="_21" const="1"/>
  <CvQualifiedType id="_85c" type="_85" const="1"/>
  <File id="f0" name="/usr/share/gccxml-0.9/GCC/4.2/gccxml_builtins.h"/>
  <File id="f1" name="/usr/include/bits/time.h"/>
  <File id="f2" name="/usr/include/sys/stat.h"/>
  <File id="f3" name="/usr/include/sys/types.h"/>
  <File id="f4" name="/usr/include/bits/pthreadtypes.h"/>
  <File id="f5" name="/usr/include/bits/types.h"/>
  <File id="f6" name="/usr/include/bits/sigset.h"/>
  <File id="f7" name="/usr/include/sys/select.h"/>
  <File id="f8" name="/usr/include/time.h"/>
  <File id="f9" name="/usr/include/sys/mman.h"/>
  <File id="f10" name="/usr/include/bits/uio.h"/>
  <File id="f11" name="/usr/include/sys/sysmacros.h"/>
  <File id="f12" name="/usr/include/bits/fcntl.h"/>
  <File id="f13" name="/usr/include/fcntl.h"/>
  <File id="f14" name="/usr/include/bits/stat.h"/>
  <File id="f15" name="/usr/lib/gcc/x86_64-linux-gnu/4.2.4/include/stddef.h"/>
</GCC_XML>
