<?xml version="1.0"?>
<GCC_XML cvs_revision="1.121">
  <Namespace id="_1" name="::" members="_3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _71 _72 _73 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _2 _21 _101 _102 _103 _104 _105 _106 _107 _108 _109 _110 _111 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _136 _137 _138 _139 _140 _141 _142 _143 _144 _145 _146 _147 _148 _149 _150 _151 _152 _153 " mangled="_Z2::" demangled="::"/>
  <Namespace id="_2" name="std" context="_1" members="" mangled="_Z3std" demangled="std"/>
  <Function id="_3" name="__builtin_nans" returns="_154" context="_1" location="f0:21" file="f0" line="21" extern="1" attributes="nothrow const nonnull">
    <Argument name="str" type="_155" location="f0:21" file="f0" line="21"/>
  </Function>
  <Function id="_4" name="__builtin_acosf" returns="_156" context="_1" mangled="acosf" location="f0:25" file="f0" line="25" extern="1" attributes="nothrow">
    <Argument type="_156" location="f0:25" file="f0" line="25"/>
  </Function>

  <Function id="_132" name="__builtin_ccosh" returns="_170" context="_1" mangled="ccosh" location="f0:106" file="f0" line="106" extern="1" attributes="nothrow pure no vops">
    <Argument type="_170" location="f0:106" file="f0" line="106"/>
  </Function>
  <Function id="_133" name="__builtin_ccosl" returns="_164" context="_1" mangled="ccosl" location="f0:104" file="f0" line="104" extern="1" attributes="nothrow pure no vops">
    <Argument type="_164" location="f0:104" file="f0" line="104"/>
  </Function>
  <Function id="_134" name="__builtin_islessgreater" returns="_161" context="_1" location="f0:143" file="f0" line="143" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Function id="_135" name="__builtin_ctanhf" returns="_163" context="_1" mangled="ctanhf" location="f0:126" file="f0" line="126" extern="1" attributes="nothrow pure no vops">
    <Argument type="_163" location="f0:126" file="f0" line="126"/>
  </Function>
  <Function id="_136" name="__builtin_ctanhl" returns="_164" context="_1" mangled="ctanhl" location="f0:128" file="f0" line="128" extern="1" attributes="nothrow pure no vops">
    <Argument type="_164" location="f0:128" file="f0" line="128"/>
  </Function>
  <Function id="_137" name="__builtin_ceilf" returns="_156" context="_1" mangled="ceilf" location="f0:37" file="f0" line="37" extern="1" attributes="nothrow const">
    <Argument type="_156" location="f0:37" file="f0" line="37"/>
  </Function>
  <Function id="_138" name="__builtin_ceill" returns="_157" context="_1" mangled="ceill" location="f0:38" file="f0" line="38" extern="1" attributes="nothrow const">
    <Argument type="_157" location="f0:38" file="f0" line="38"/>
  </Function>
  <Function id="_139" name="__builtin_csinf" returns="_163" context="_1" mangled="csinf" location="f0:114" file="f0" line="114" extern="1" attributes="nothrow pure no vops">
    <Argument type="_163" location="f0:114" file="f0" line="114"/>
  </Function>
  <Function id="_140" name="__builtin_csinh" returns="_170" context="_1" mangled="csinh" location="f0:118" file="f0" line="118" extern="1" attributes="nothrow pure no vops">
    <Argument type="_170" location="f0:118" file="f0" line="118"/>
  </Function>
  <Function id="_141" name="__builtin_csinl" returns="_164" context="_1" mangled="csinl" location="f0:116" file="f0" line="116" extern="1" attributes="nothrow pure no vops">
    <Argument type="_164" location="f0:116" file="f0" line="116"/>
  </Function>
  <Function id="_142" name="__builtin_acos" returns="_154" context="_1" mangled="acos" location="f0:24" file="f0" line="24" extern="1" attributes="nothrow">
    <Argument type="_154" location="f0:24" file="f0" line="24"/>
  </Function>
  <Function id="_143" name="__builtin_ctzll" returns="_158" context="_1" location="f0:98" file="f0" line="98" extern="1" attributes="nothrow const">
    <Argument type="_162" location="f0:98" file="f0" line="98"/>
  </Function>
  <Function id="_144" name="__builtin_cargf" returns="_156" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_163" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_145" name="__builtin_cargl" returns="_157" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_164" location="f0:95" file="f0" line="95"/>
  </Function>
  <Function id="_146" name="__builtin_cosf" returns="_156" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_156" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_147" name="__builtin_cosh" returns="_154" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_154" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_148" name="__builtin_cosl" returns="_157" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_157" location="f0:44" file="f0" line="44"/>
  </Function>
  <Function id="_149" name="__builtin_isgreater" returns="_161" context="_1" location="f0:139" file="f0" line="139" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Function id="_150" name="__builtin_sinf" returns="_156" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_156" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_151" name="__builtin_sinh" returns="_154" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_154" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_152" name="__builtin_sinl" returns="_157" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_157" location="f0:80" file="f0" line="80"/>
  </Function>
  <Function id="_153" name="__builtin_csin" returns="_170" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_170" location="f0:115" file="f0" line="115"/>
  </Function>
  <FundamentalType id="_154" name="double" size="64" align="64"/>
  <PointerType id="_155" type="_184c" size="32" align="32"/>
  <FundamentalType id="_156" name="float" size="32" align="32"/>
  <FundamentalType id="_157" name="long double" size="96" align="32"/>
  <FundamentalType id="_158" name="int" size="32" align="32"/>
  <PointerType id="_159" type="_172c" size="32" align="32"/>
  <PointerType id="_160" type="_21" size="32" align="32"/>
  <FundamentalType id="_161" name="bool" size="8" align="8"/>
  <FundamentalType id="_162" name="long long int" size="64" align="64"/>
  <FundamentalType id="_163" name="complex float" size="64" align="32"/>
  <FundamentalType id="_164" name="complex long double" size="192" align="32"/>
  <Field id="_165" name="dli_fname" type="_155" offset="0" context="_21" access="public" location="f1:91" file="f1" line="91"/>
  <Field id="_166" name="dli_fbase" type="_169" offset="32" context="_21" access="public" location="f1:92" file="f1" line="92"/>
  <Field id="_167" name="dli_sname" type="_155" offset="64" context="_21" access="public" location="f1:93" file="f1" line="93"/>
  <Field id="_168" name="dli_saddr" type="_169" offset="96" context="_21" access="public" location="f1:94" file="f1" line="94"/>
  <PointerType id="_169" type="_172" size="32" align="32"/>
  <FundamentalType id="_170" name="complex double" size="128" align="64"/>
  <PointerType id="_171" type="_169" size="32" align="32"/>
  <FundamentalType id="_172" name="void" align="8"/>
  <PointerType id="_173" type="_158" size="32" align="32"/>
  <PointerType id="_174" type="_156" size="32" align="32"/>
  <PointerType id="_175" type="_157" size="32" align="32"/>
  <CvQualifiedType id="_169r" type="_169" restrict="1"/>
  <CvQualifiedType id="_155r" type="_155" restrict="1"/>
  <Field id="_178" name="dls_name" type="_183" offset="0" context="_102" access="public" location="f1:174" file="f1" line="174"/>
  <Field id="_179" name="dls_flags" type="_112" offset="32" context="_102" access="public" location="f1:175" file="f1" line="175"/>
  <Field id="_180" name="dls_size" type="_113" offset="0" context="_103" access="public" location="f1:182" file="f1" line="182"/>
  <Field id="_181" name="dls_cnt" type="_112" offset="32" context="_103" access="public" location="f1:183" file="f1" line="183"/>
  <Field id="_182" name="dls_serpath" type="_187" offset="64" context="_103" access="public" location="f1:184" file="f1" line="184"/>
  <PointerType id="_183" type="_184" size="32" align="32"/>
  <ArrayType id="_187" min="0" max="0u" type="_102" size="64" align="32"/>
  <FundamentalType id="_184" name="char" size="8" align="8"/>
  <CvQualifiedType id="_184c" type="_184" const="1"/>
  <CvQualifiedType id="_172c" type="_172" const="1"/>
  <File id="f0" name="/usr/share/gccxml-0.9/GCC/4.3/gccxml_builtins.h"/>
  <File id="f1" name="/usr/include/dlfcn.h"/>
  <File id="f2" name="/usr/include/bits/dlfcn.h"/>
  <File id="f3" name="/usr/lib/gcc/i486-linux-gnu/4.4.1/include/stddef.h"/>
</GCC_XML>
